Revit 2027 API
WallPaint.WallpaintApplication Property
 The property labeled "Application" from the "WallPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string WallpaintApplication { get; }
Public Shared ReadOnly Property WallpaintApplication As String
	Get
public:
static property String^ WallpaintApplication {
	String^ get ();
}
static member WallpaintApplication : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "WallpaintApplicationType".
See Also
Reference
WallPaint Class
Autodesk.Revit.DB.Visual Namespace